'''Петя и Катя – брат и сестра. Петя – студент, а Катя – школьница. Петя помогает Кате по математике.
Он задумывает два натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать.
Для этого Петя делает две подсказки. Он называет сумму этих чисел S и их произведение P.
Помогите Кате отгадать задуманные Петей числа.'''

S = int(input('Введите сумму: '))
P = int(input('Введите произведение: '))
divisors, part = [], []

for i in range(1, S+1): #задача решается корректно только при вводе положительных чисел
    if P % i == 0:
        divisors.append(i)

for div in divisors:
    if S - div == P / div:
        part.append(div)

print(*part)