"""Заполните массив элементами арифметической прогрессии. Ее первый элемент, разность и количество элементов нужно ввести с клавиатуры.
Формула для получкения n-го члена прогрессии: an = a1 + (n-1) * d. Каждое число вводится с новой строки."""

a1 = int(input('Введите первый элемент арифметической прогрессии: '))
d = int(input('Введите разность арифметической прогрессии: '))
n = int(input('Введите количество элементов арифметической прогрессии: '))

array = list()

for _ in range(n):
    array.append(a1); a1 += d

# for i in array:
#   print(i)       # если каждый элемент массива нужно выводить на отдельной строке

print(*array)